package com.happy_user.quizapp

object Constants {

    fun getQuestions():ArrayList<Question>{
        val questionList = java.util.ArrayList<Question>()

        val question1 = Question(
            1,
            "Салоҳияти кормандони мақомоти гумрук дар кадом моддаи КГҶТ омадааст?",
            "моддаи 460",
            "моддаи 467",
            "моддаи 475",
            "моддаи 502",
            2
        )
        questionList.add(question1)

        val question2 = Question(
            2,
            "Дар бораи Парчам ва аломатҳои фарқкунандаи мақомоти гумрук дар кадом модда оварда шудааст?",
            "моддаи 463",
            "моддаи 485",
            "моддаи 471",
            "моддаи 432",
            1
        )
        questionList.add(question2)

        val question3 = Question(
            3,
            "Дар моддаи 471 Кодекси гумруки Ҷумҳурии Тоҷикистон сухан дар бораи чӣ меравад?",
            "Ҷавобгарии мақомоти гумрук ва шахсони мансабдори онҳо",
            "Фаъолияти мутақобила ва ҳамкории мақомоти гумрук бо дигар мақомоти давлатӣ",
            "Назорати идории фаъолияти мақомоти гумрук",
            "Ҳуқуқи мақомоти гумрук нисбати воситаҳои нақлиёти автомобилие, ки моли таҳти назорати гумрукро интиқол медиҳанд",
            3
        )
        questionList.add(question3)

        val question4 = Question(
            2,
            "Мафҳумҳои асосӣ чандтоянд ва дар кадом модда оварда шудаанд?",
            "моддаи 10, 39-то",
            "моддаи 10, 10-то",
            "моддаи 10, 19-то",
            "моддаи 10, 29-то",
            1
        )
        questionList.add(question4)

        val question5 = Question(
            5,
            "Риояи мамнӯият ва маҳдудиятҳо ҳангоми интиқоли мол ва воситаҳои нақлиёт аз сарҳади гумрукӣ дар кадом модда оварда шудааст?",
            "моддаи 16",
            "моддаи 15",
            "моддаи 13",
            "моддаи 12",
            4
        )
        questionList.add(question5)

        val question6 = Question(
            6,
            "Захираҳои иттилоотии мақомоти гумрук дар кадом модда оварда шудааст?",
            "моддаи 504",
            "моддаи 506",
            "моддаи 508",
            "моддаи 507",
            1
        )
        questionList.add(question6)

        val question7 = Question(
            2,
            "Дар бораи Системаҳои иттилоотӣ, технологияҳои иттилоотӣ ва воситаҳои таъмини онҳо, ки дар мақомоти гумрук истифода мешаванд дар кадом модда оварда шудааст?",
            "моддаи 500",
            "моддаи 501",
            "моддаи 502",
            "моддаи 499",
            3
        )
        questionList.add(question7)

        val question8 = Question(
            8,
            "Дар бораи Парчам ва аломатҳои фарқкунандаи мақомоти гумрук дар кадом модда оварда шудааст?",
            "моддаи 463",
            "моддаи 485",
            "моддаи 471",
            "моддаи 432",
            1
        )
        questionList.add(question8)

        val question9 = Question(
            9,
            "Барқароркунии кормандони мақомоти гумрук ба хизмат дар мақомоти гумрук дар кадом модда оварда шудааст?",
            "моддаи 499",
            "моддаи 501",
            "моддаи 471",
            "моддаи 432",
            2
        )
        questionList.add(question9)

        val question10 = Question(
            10,
            "Истифодаи қувваи ҷисмонӣ аз тарафи шахсони мансабдори мақомоти гумрук дар кадом модда оварда шудааст?",
            "моддаи 475",
            "моддаи 473",
            "моддаи 471",
            "моддаи 474",
            4
        )
        questionList.add(question10)

        return questionList
    }
}